function makeTestItem(question, answers, correctAnswer, imgExampleCode){
	return {question, answers, correctAnswer, imgExampleCode};
};

var test1 = [
	makeTestItem("На прикладі якого інтерфейсу розглядаються уроки по роботі з системою WM:",
		["Інтерфейсу блокноту",
		"Текстового інтерейсу",
		"Інтерфейсу WSTP",
		"Іншого інтерфейсу"], 0),
	makeTestItem("Виберіть правильне твердження:",
		["Інтерфейс блокноту надає доступ до більшої кількості функцій ядра WM, аніж текстовий інтерфейс",
		"У текстовому інтерфейсі доступні графічні можливості і динамічна інтерактивність інтерфейсу блокноту",
		"Текстовий інтерфейс надає доступ до більшої кількості функцій ядра WM, аніж інтерфейс блокноту, проте не доступні графічні можливості і динамічна інтерактивність інтерфейсу блокноту",
		"Всі твердження невірні"], 2),
	makeTestItem("Файли блокнотів мають розширення:",
		[".notebook",
		".ntbk",
		".note",
		".nb"], 3),
	makeTestItem("Секії можуть містити:",
		["Лише текст",
		"Лише текст, графіки та вирази мовою WM",
		"Текст, графіки, аудіо, вирази мовою Wolfram, динамічні інтерактивні елементи і т. п., але не можуть містити інші секції",
		"Текст, графіки, аудіо, вирази мовою Wolfram, динамічні інтерактивні елементи і т. п., а також можуть містити інші секції"], 3),
	makeTestItem("Секції, які створюються автоматично після введення першого символу, по замовчуванню:",
		["Не мають стиля. Його необхідно задати",
		"Мають стиль Input",
		"Мають стиль Text",
		"Мають стиль Section"], 1),
	makeTestItem("Щоб відправити вираз ядру WM на обробку необхідно натиснути:",
		["Shift+Enter",
		"Alt+Enter",
		"Ctrl+Enter",
		"Alt+2"], 0),
	makeTestItem("Вихідна секція (зі стилем Output) розміщується:",
		["Ліворуч вхідної",
		"Над вхідною",
		"Під вхідною",
		"Праворуч вхідної"], 2),
	makeTestItem("Вхідні секції (зі стилем Input) розміщуються в блокноті:",
		["В строгому порядку: та що була введена пізніше, розміщується нижче, та що раніше - вище",
		"В строгому порядку: та що була введена пізніше, розміщується вище, та що раніше - нижче",
		"В довільному порядку: час введення не визначає позицію секції, її позиція визначається користувачем",
		"Немає вірної відповіді"], 2),
	makeTestItem("Номер n у позначеннях секцій In[n]:=, Out[n]:= позначає:",
		["Позицію секції в блокноті",
		"Відносний час обробки секції ядром WM відносно інших секцій",
		"Кількість рядків у секції",
		"Обєм даних секції у байтах"], 1),
	makeTestItem("При закритті групи, по замовчуванню:",
		["Усі секції групи стають невидимими",
		"Залишається видимою перша і остання секція групи",
		"Залишається видимою остання секція групи",
		"Залишається видимою перша секція групи"], 3)
];

var test2 = [
	makeTestItem("Пробіл між числами або змінними у арифметичних операціях є операцією:",
		["Недопустимою",
		"Додавання",
		"Множення",
		"Піднесення до степеня"], 2),
	makeTestItem("Результат виконання виразу, наведеного на рисунку нижче:",
		["12",
		"1073741824",
		"Повідомлення про помилку",
		"60"], 3, 'image1.jpg'),
	makeTestItem("Результат виконання виразів, наведених на рисунку нижче, у порядку їх розміщення:",
		["2.16667, 2.23607, 4",
		"2.16667, &radic;5, 4",
		"13/6, &radic;5, 4",
		"13/6, &radic;5, &radic;16"], 2, 'image2.jpg'),
	makeTestItem("Результат виконання виразів, наведених на рисунку нижче, у порядку їх розміщення:",
		["2.16667, 2.23607, 4.",
		"2.16667, 2.23607, 4",
		"13/6., 2.23607, 4",
		"13/6., 2.23607, 4."], 0, 'image3.jpg'),
	makeTestItem("Результат виконання виразів, наведених на рисунку нижче, у порядку їх розміщення:",
		["2.16667, 2.23607, 4.",
		"2.16667, 2.23607, 4",
		"13/6., 2.23607, 4",
		"13/6., 2.23607, 4."], 0, 'image4.jpg'),
	makeTestItem("Результат виклику функції, наведеної на рисунку нижче:",
		["Помилка: недопустима кількість параметрів",
		"10",
		"24",
		"4096"], 2, 'image5.jpg'),
	makeTestItem("Параметри функції можуть передаватися у:",
		["Квадратних [] і круглих () дужках",
		"Квадратних [] і фігурних {} дужках",
		"Лише квадратних [] дужках",
		"Квадратних [], фігурних {} і круглих () дужках"], 2),
	makeTestItem("Результат виклику функцій, наведених на рисунку нижче, у порядку їх розміщення:",
		["Помилка, Помилка, Помилка, Помилка",
		"Помилка, Помилка, 10, 5",
		"0, 1, 10, 5",
		"0, 0, 10, 0"], 2, 'image6.jpg'),
	makeTestItem("На рисунку зображена послідовність команд. Виберіть послідовність значень, що буде повертати х:",
		["Помилка, 27",
		"Помилка, Помилка",
		"y^3, y^3",
		"y^3, 27"], 3, 'image7.jpg'),
	makeTestItem("На рисунку зображена послідовність команд. Виберіть послідовність значень, що буде повертати х:",
		["27, 125",
		"27, 27",
		"y^3, y^3",
		"y^3, 125"], 1, 'image8.jpg'),
	makeTestItem("На рисунку зображена послідовність команд. Виберіть послідовність значень, що буде повертати х:",
		["5 + z, 7",
		"5 + z, 9",
		"y + z, 7",
		"Помилка, 7",
		"5 + z, 5 + z"], 1, 'image9.jpg'),
	makeTestItem("На рисунку зображена послідовність команд. Виберіть послідовність значень, що буде повертати х:",
		["5 + z, 7",
		"5 + z, 9",
		"y + z, 7",
		"Помилка, 7",
		"5 + z, 5 + z"], 0, 'image10.jpg'),
	makeTestItem("Визначення функції можна переглянути за допомогою оператора:",
		[":",
		"?",
		"!",
		"%"], 1),
	makeTestItem("На рисунку зображено визначення функції і її виклик. Виберіть послідовність значень, яку повертають виклики функції:",
		["11, 10, 4",
		"11, 1, 4",
		"0, 1, 4",
		"0, 10, 4"], 0, 'image11.jpg'),
	makeTestItem("На рисунку зображено визначення функції і її виклик. Виберіть послідовність значень, яку повертають виклики функції:",
		["3, 3, 3",
		"5, 5, 5",
		"5, 5, 8",
		"5, 7, 7",
		"5, 7, 8",
		"3, 7, 8"], 1, 'image12.jpg'),
	makeTestItem("На рисунку зображено визначення функцій і їх виклик. Порівняйте вирази, що повертають перша та друга пара викликів функцій:",
		["Однакові, Однакові",
		"Однакові, Різні",
		"Різні, Однакові",
		"Різні, Різні"], 1, 'image13.jpg'),
	makeTestItem("Назва об'єкту незайнята, якщо при введенні вона відображається:",
		["Синім кольором",
		"Жовтим кольором",
		"Зеленим кольором",
		"Чорним кольором"], 0),
	makeTestItem("Назва об'єкту зайнята, якщо при введенні вона відображається:",
		["Синім кольором",
		"Жовтим кольором",
		"Зеленим кольором",
		"Чорним кольором"], 3)
];

var test3 = [
	makeTestItem("Для розділення операцій використовується символ:",
		[".",
		";",
		",",
		":"], 1),
	makeTestItem("На рисунку зображена послідовність операцій. Виберіть що буде виведено при її виконанні:",
		["8, 5, 20",
		"20",
		"Нічого",
		"Помилка виконання"], 2, 'image14.jpg'),
	makeTestItem("На рисунку зображена послідовність операцій. Виберіть що буде повернено при її виконанні:",
		["8, 5, 20",
		"20",
		"Нічого",
		"Помилка виконання"], 0, 'image15.jpg'),
	makeTestItem("На рисунку зображена послідовність операцій. Виберіть що буде повернено при її виконанні:",
		["8, 5, 20",
		"20",
		"Нічого",
		"Помилка виконання"], 3, 'image16.jpg'),
	makeTestItem("На рисунку зображена послідовність операцій. Виберіть що буде повернено при її виконанні:",
		["8, 5, 20",
		"20",
		"Нічого",
		"Помилка виконання"], 0, 'image17.jpg'),
	makeTestItem("На рисунку зображена послідовність операцій і результат їх виконання. Виберіть результат виконання ще не виконаної операції, що використовує попередні результати:",
		["2",
		"-2",
		"1",
		"-1"], 3, 'image18.jpg'),
	makeTestItem("На рисунку зображена послідовність операцій і результат їх виконання. Виберіть результат виконання ще не виконаних операцій, що використовують попередні результати:",
		["7, -15",
		"4, -84",
		"4, -51",
		"7, -25",
		"4, -30",
		"4, -28"], 2, 'image19.jpg'),
	makeTestItem("Дужка секції, яка виконується (обчислюється) в даний момент, зафарбована у:",
		["Жирний синій колір",
		"Жирний чорний колір",
		"Чорний колір",
		"Червоний колір"], 1),
	makeTestItem("Для миттєвого переривання обчислення використовується комбінація клавіш:",
		["Alt + ,",
		"Alt + .",
		"Alt + :",
		"Alt + ;"], 1),
	makeTestItem("Виберіть результат, еквівалетний результату обчислення алгебраїчного виразу, зображеного на рисунку:",
		["7x^2 - 2x",
		"7x^2 - 2x^5",
		"5/4 - x",
		"Правильна відповідь відсутня"], 1, 'image20.jpg')
];

var allTest = [test1, test2, test3];
var choosedTest;
var score = 0;
yourAnswer = [];
function putAnswer(question, answer){
	yourAnswer[question] = answer;
}

function getScore(){
	if (yourAnswer.length < choosedTest.length) {
		alert('Ви відповіли не на всі запитання');
		return;
	}
	for(var i = 0; i < yourAnswer.length; i++){
		if(yourAnswer[i] == choosedTest[i].correctAnswer){
			score++;
		}
	}
	document.getElementById('testForm').remove();
	var result = document.createElement('p');
	result.id = 'testResult';
	result.innerHTML = 'Результат: ' + score + '/' + choosedTest.length;
	document.getElementById('test').appendChild(result);
}

function update(){
	var testResult = document.getElementById('testResult');
	if (testResult != undefined)
		testResult.remove();
	
	var testForm = document.getElementById('testForm');
	if (testForm != undefined)
		testForm.remove();
	
	var testBody = document.createElement('ul');
	testBody.id = 'testBody';
	var idxChoosedTest = document.getElementById('testSelect').selectedIndex;
	choosedTest = allTest[idxChoosedTest];
	
	var testName = document.getElementById('testName');
	if (testName != undefined)
		testName.remove();
	testName = '<p id = testName>Тест до уроку ' + (idxChoosedTest + 1) + '</p>';
	document.getElementById('test').insertAdjacentHTML('beforeEnd', testName);
	var testBodyHTML = '';
	for(var i = 0; i < choosedTest.length; i++) {
		var testItem = choosedTest[i];
		testBodyHTML += '<li><p class = questionItem>' + (i + 1) + '. ' + testItem.question + '</p>';
		if (testItem.imgExampleCode != undefined)
			testBodyHTML += '<img class = imgExampleCode src = img/test/' + testItem.imgExampleCode + ' >';
		for(var j = 0; j < testItem.answers.length; j++) {
			testBodyHTML += '<p class = answerItem><label onClick = putAnswer(' + i + ',' + j + ')><input type=radio name = q' + i + ' value = ' + i + '>' + testItem.answers[j] + '</label></p>';
		}
		testBodyHTML += '</li>';
	}
	
	testBody.innerHTML = testBodyHTML;
	var btSend = "<button id = btSend type = button onClick = getScore()>Відправити</button>";
	
	testForm = document.createElement('form');
	testForm.id = 'testForm';
	testForm.appendChild(testBody);
	testForm.insertAdjacentHTML('beforeEnd', btSend);
	
	document.getElementById('test').appendChild(testForm);
	
	score = 0;
	yourAnswer = [];
}

document.getElementById('btChoose').onclick = update;